[Anarchist X2SoldierClassTemplate]
DisplayName = "Anarchist"
ClassSummary = "The Anarchist is a support demolitionist that likes to create chaos on the battlefield."
LeftAbilityTreeTitle = "Demolitions"
RightAbilityTreeTitle = "Mastermind"

[MicroGrenadeLauncher_CV X2GrenadeLauncherTemplate]
FriendlyName="Micro-Grenade Launcher"
FriendlyNamePlural="Micro-Grenade Launchers"
BriefSummary="This grenade launcher variant fires smaller grenades with more grenade capacity."
TacticalText="<Bullet/> The micro-grenade launcher is the Anarchist's specialty weapon.\n<Bullet/> It has a substantially increased range relative to throwing."
AbilityDescName="Micro-Grenade Launcher"

[MicroGrenadeLauncher_MG X2GrenadeLauncherTemplate]
FriendlyName="Advanced Micro-Grenade Launcher"
FriendlyNamePlural="Advanced Micro-Grenade Launchers"
BriefSummary="This grenade launcher variant fires smaller grenades with more grenade capacity."
TacticalText="<Bullet/> The Advanced Micro-Grenade Launcher has an increased range and explosive radius over the standard Micro-Grenade Launcher.\n."
AbilityDescName="Advanced Micro-Grenade Launcher"

[GrimyFlamethrower X2WeaponTemplate]
FriendlyName="Flamethrower"
FriendlyNamePlural="Flamethrowers"
BriefSummary="This wrist-mounted flamethrower relies on a super-pressurized fuel canister and a very focused nozzle to unleash a deadly cone of fire on multiple enemies."
TacticalText="<Bullet/> The Flamethrower is an area-of-effect weapon that can lay waste to part of the battlefield.\n<Bullet/> It is useful against multiple enemies, and at close quarters. Robotic enemies will be resistant or immune to its effects, however."

[GrimyShredderGun X2WeaponTemplate]
FriendlyName="Shredder Gun"
FriendlyNamePlural="Shredder Guns"
BriefSummary="This wrist-mounted slugthrower sprays a cone of razor-sharp particles, damaging multiple enemies and shredding their armor."
TacticalText="<Bullet/>The Shredder Gun is useful against multiple enemies, and at close quarters.\n<Bullet/> Its ammo is limited, so use it only when it will be decisive."

[GrimyShellShockUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Anarchist: Shellshock"
Summary="Grenades have a 15% chance to stun both organic and robotic enemies."

[GrimyLightOrdnance X2AbilityTemplate]
LocFriendlyName="Light Ordnance"
LocHelpText="Increase grenade capacity by 2 in each slot, but decrease grenade damage by 50%."
LocLongDescription="Increase grenade capacity by 2 in each slot, but decrease grenade damage by 50%."

[GrimyGrenadeShredder X2AbilityTemplate]
LocFriendlyName="Grenade Shredder"
LocHelpText="Increase grenade shredding and armor piercing by 2."
LocLongDescription="Increase grenade shredding and armor piercing by 2."

[GrimySabotage X2AbilityTemplate]
LocFriendlyName="Sabotage"
LocHelpText="Provides combat protocol ability, if not yet available. Upgrades combat protocol to disarm enemy weapons."
LocLongDescription="Provides combat protocol ability, if not yet available.\nUpgrades combat protocol to disarm enemy weapons."

[GrimyDeadlyHaze X2AbilityTemplate]
LocFriendlyName="Deadly Haze"
LocHelpText="Increase tile coverage of fire, acid, and poison from grenades to 100%."
LocLongDescription="Increase tile coverage of fire, acid, and poison from grenades to 100%."

[GrimyLongShot X2AbilityTemplate]
LocFriendlyName="Longshot"
LocHelpText="Increase grenade launcher range by 50%."
LocLongDescription="Increase grenade launcher range by 50%."

[GrimyCauterize X2AbilityTemplate]
LocFriendlyName="Cauterize"
LocHelpText="Deal 2 damage to a unit, if it survives, heal it for 3-9 life."
LocLongDescription="Deal 2 damage to a unit, if it survives, heal it for 3-9 life.\nCan target both allies and enemies.\n2 uses per mission.\nProvides the revival protocol ability."

[GrimyVileConcoctions X2AbilityTemplate]
LocFriendlyName="Vile Concoctions"
LocHelpText="Increase DoT damage from grenades by 2."
LocLongDescription="Increase DoT damage from grenades by 2."

[GrimySadist X2AbilityTemplate]
LocFriendlyName="Sadist"
LocHelpText="Gain two additional skullmining charges when a skulljack is equipped."
LocLongDescription="Gain two additional skullmining charges when a skulljack is equipped."

[GrimyHostageProtocol X2AbilityTemplate]
LocFriendlyName="Hostage Protocol"
LocHelpText="Provides combat protocol ability, if not yet available. Upgrades combat protocol to stun an enemy and turn it into high cover for a turn."
LocLongDescription="Provides combat protocol ability, if not yet available.\nUpgrades combat protocol to stun an enemy and turn it into high cover for a turn."

[GrimyFlamethrower X2AbilityTemplate]
LocFriendlyName="Firewall"
LocHelpText="Gain a single use flamethrower that creates a wall of fire that can't be crossed without being burned."
LocLongDescription="Gain a single use flamethrower that creates a wall of fire that can't be crossed without being burned."

[ShredderGun X2WeaponTemplate]
LocLongDescription="Gain a single use shredder gun."

[GrimyAirBurst X2AbilityTemplate]
LocFriendlyName="Air Burst"
LocHelpText="Increase grenade launcher radius by 2."
LocLongDescription="Increase grenade launcher radius by 2."